import nltk

# реализация функций для сегментации и токенизации
def snt(text):
    sentences = nltk.sent_tokenize(text, language="russian")
    for i,s in enumerate(sentences): 
        print(i, '  ',s)
    print("\n"+"#"*25)

def tkn(text):
    tokens = nltk.word_tokenize(text)
    print(tokens)
    print("\n"+"#"*25)


# тестирование токенизации
token_cases = [
    "СУ-35, А380, Р236РВ177, Т12-B15, ГПТ-122У",
    "Дата: 23.07.2025, 1/1/2000; время: 14.00",
    "Сокращения: и т.д., шт., рис.",
    "черно-белый, пол-арбуза",
    "А.С. Пушкин, Я.С. Соловьев",
    "3.5 м/с, 15%, 10 кг, -87.21Е-5, 999$, 1/2"
]

for i, case in enumerate(token_cases):
    print(f"\nТест {i}: {case}")
    tkn(case)


# тестирование сегментирования
sentence_cases = [
    "Заседание комиссии по проекту 'Заря-2' назначено на 15.09.2024 на 14:30 в каб. 401. Докладчик — проф. А.В. Семенов. По итогам первого этапа КПД установки составил 75,5%, что на 12.3% выше планового показателя, т.е. результат более чем удовлетворительный. Однако расход материалов, напр., катализатора, превысил расчетный на 0,75 кг. См. график 1.1 на стр. 5 отчета. Следующее заседание предварительно запланировано на декабрь с.г.",

    "«Иван Петрович, вы уже просмотрели договор? — спросила секретарша. — Клиент ждет ответа». Он вздохнул: «Нет еще... Дело в том, что п. 4.2 вызывает вопросы, т.к. трактуется двояко». «Т.е. нам нужны правки?» — уточнила она. «Именно! — воскликнул он. — Срочно свяжись с юристом, к.т.н. Сидоровой А.К., и обсуди этот момент. Может, она примет участие в совещании в 17:00?».",

    "Великий князь Московский Иван III Васильевич, правивший с 1462 по 1505 г., вошел в историю как собиратель земель русских. Его брак с византийской принцессой Софией Палеолог, племянницей последнего императора, т.е. З.П. Палеолога, имел огромное политическое значение. Важным событием т.н. «стояния на Угре» 1480 г. стало окончательное освобождение от ордынской зависимости. Кстати, см. работу акад. РАН В.Л. Янина по этому вопросу.",
    
    "Сегодня, 1.05.2024, в 10:00 утра состоялось открытие нового ледового дворца «Айс-берг». «Это грандиозное событие для всего города! — заявил мэр И.И. Сидоров. — Теперь у наших детей, в т.ч. и у ребят с ограниченными возможностями, есть современная площадка». Строительство обошлось в 3,5 млрд рублей и длилось 2,5 года. По словам ген. подрядчика ООО «Строй-гарант», объект сдан досрочно. К сведению: катки будут работать с 9:00 до 23:00.",

    "Ты уже посмотрел новый сериал?.. Мне кажется, это просто нечто!.. Сюжет такой запутанный... Главный герой — гениальный ученый, типа доктора Кто, но только наш, Иванов П.П. А в 3-й серии вообще шоковый поворот... Жду твоего мнения! Кстати, встречаемся завтра в 19:00 у метро?.."
]

for i, case in enumerate(sentence_cases):
    print(f"\nТест {i}: {case}")
    snt(case)